{
    "name": "Drum Machine",
    "tagline": "A frontend project, part of Free Code Camp's curriculum",
    "for": "Practice: freeCodeCamp",
    "thumb": "/images/projects/drum-machine-thumb.jpg",
    "logo_inv": "/images/logos/freecodecamp-inverse.svg",
    "url": "//codepen.io/ilovepku/full/WLpYRz",
    "desc": "Project summary goes here. Etiam rhoncus. Maecenas tempus, tellus eget condimentum rhoncus, sem quam semper libero, sit amet adipiscing sem neque sed ipsum. Nam quam nunc, blandit vel, luctus pulvinar, hendrerit id, lorem. Maecenas nec odio et ante tincidunt tempus. Donec vitae sapien ut libero venenatis faucibus. Nullam quis ante. Etiam sit amet orci eget eros faucibus tincidunt. Duis leo. Sed fringilla mauris sit amet nibh. Donec sodales sagittis magna. Sed consequat, leo eget bibendum sodales, augue velit cursus nunc, quis gravida magna mi a libero. Fusce vulputate eleifend sapien. Vestibulum purus quam, scelerisque ut, mollis sed, nonummy id, metus.",
    "story": ["I should be able to see an outer container with a corresponding id=\"drum-machine\" that contains all other elements.", "Within #drum-machine I can see an element with a corresponding id=\"display\".", "Within #drum-machine I can see 9 clickable drum pad elements, each with a class name of drum-pad, a unique id that describes the audio clip the drum pad will be set up to trigger, and an inner text that corresponds to one of the following keys on the keyboard: Q, W, E, A, S, D, Z, X, C. The drum pads MUST be in this order.", "Within each .drum-pad, there should be an HTML5 audio element which has a src attribute pointing to an audio clip, a class name of clip, and an id corresponding to the inner text of its parent .drum-pad (e.g. id=\"Q\", id=\"W\", id=\"E\" etc.).", "When I click on a .drum-pad element, the audio clip contained in its child audio element should be triggered.", "When I press the trigger key associated with each .drum-pad, the audio clip contained in its child audio element should be triggered (e.g. pressing the Q key should trigger the drum pad which contains the string \"Q\", pressing the W key should trigger the drum pad which contains the string \"W\", etc.).", "When a .drum-pad is triggered, a string describing the associated audio clip is displayed as the inner text of the #display element (each string must be unique)."],
    "pic": "",
    "tech": ["React", "Bootstrap", "JavaScript", "CSS"],
    "type": "Frontend",
    "html": "<iframe height='400' scrolling='no' title='FCC: Frontend - Drum Machine' src='//codepen.io/ilovepku/embed/WLpYRz/?height=418&theme-id=0&default-tab=js,result' frameborder='no' allowtransparency='true' allowfullscreen='true' style='width: 100%;'>See the Pen <a href='https://codepen.io/ilovepku/pen/WLpYRz/'>FCC: Frontend - Drum Machine</a> by Sean Lee (<a href='https://codepen.io/ilovepku'>@ilovepku</a>) on <a href='https://codepen.io'>CodePen</a>.</iframe>"
}