{
    "name": "Exercise Tracker REST API",
    "tagline": "A microservice project, part of Free Code Camp's curriculum",
    "for": "Practice: freeCodeCamp",
    "thumb": "/images/projects/backend-exercise-tracker-thumb.jpg",
    "logo_inv": "/images/logos/freecodecamp-inverse.svg",
    "url": "//fcc-backend-exercise-tracker.glitch.me",
    "desc": "Project summary goes here. Etiam rhoncus. Maecenas tempus, tellus eget condimentum rhoncus, sem quam semper libero, sit amet adipiscing sem neque sed ipsum. Nam quam nunc, blandit vel, luctus pulvinar, hendrerit id, lorem. Maecenas nec odio et ante tincidunt tempus. Donec vitae sapien ut libero venenatis faucibus. Nullam quis ante. Etiam sit amet orci eget eros faucibus tincidunt. Duis leo. Sed fringilla mauris sit amet nibh. Donec sodales sagittis magna. Sed consequat, leo eget bibendum sodales, augue velit cursus nunc, quis gravida magna mi a libero. Fusce vulputate eleifend sapien. Vestibulum purus quam, scelerisque ut, mollis sed, nonummy id, metus.",
    "story": ["I can create a user by posting form data username to /api/exercise/new-user and returned will be an object with username and _id.", "I can get an array of all users by getting api/exercise/users with the same info as when creating a user.", "I can add an exercise to any user by posting form data userId(_id), description, duration, and optionally date to /api/exercise/add. If no date supplied it will use current date. Returned will the the user object with also with the exercise fields added.", "I can retrieve a full exercise log of any user by getting /api/exercise/log with a parameter of userId(_id). Return will be the user object with added array log and count (total exercise count).", "I can retrieve part of the log of any user by also passing along optional parameters of from & to or limit. (Date format yyyy-mm-dd, limit = int)"],
    "pic": "",
    "tech": ["NodeJS", "MongoDB", "JavaScript"],
    "type": "Backend",
    "html": "<div class=\"glitch-embed-wrap\" style=\"height: 420px; width: 100%;\"><iframe allow=\"geolocation; microphone; camera; midi; encrypted-media\" src=\"https://glitch.com/embed/#!/embed/fcc-backend-exercise-tracker?path=README.md&previewSize=100\" alt=\"fcc-backend-exercise-tracker on Glitch\" style=\"height: 100%; width: 100%; border: 0;\"></iframe></div>"
}