{
  "name": "Heat Map",
  "tagline": "A data visualization project, part of Free Code Camp's curriculum",
  "for": "Practice: freeCodeCamp",
  "thumb": "/images/projects/heat-map-thumb.jpg",
  "logo_inv": "/images/logos/freecodecamp-inverse.svg",
  "tech": ["D3", "JavaScript", "CSS"],
  "ctg": ["Data-viz", "Frontend", "Practice"],

  "url": "https://codepen.io/laylapku/full/zMBVev",
  "pic": "",
  "html": "<iframe height='500' style='width: 100%;' scrolling='no' title='FCC Data Visualization Projects - Heat Map' src='https://codepen.io/laylapku/embed/zMBVev?height=265&theme-id=0&default-tab=js,result' frameborder='no' allowtransparency='true' allowfullscreen='true'>See the Pen <a href='https://codepen.io/laylapku/pen/zMBVev'>FCC Data Visualization Projects - Heat Map</a> by Layla(<a href='https://codepen.io/laylapku'>@laylapku</a>) on <a href='https://codepen.io'>CodePen</a>.</iframe>",
  "story": [
    "My heat map should have a title with a corresponding id=\"title\".",
    "My heat map should have a description with a corresponding id=\"description\".",
    "My heat map should have an x-axis with a corresponding id=\"x-axis\".",
    "My heat map should have a y-axis with a corresponding id=\"y-axis\".",
    "My heat map should have rect elements with a class=\"cell\" that represent the data.",
    "There should be at least 4 different fill colors used for the cells.",
    "Each cell will have the properties data-month, data-year, data-temp containing their corresponding month, year, and temperature values.",
    "The data-month, data-year of each cell should be within the range of the data.",
    "My heat map should have cells that align with the corresponding month on the y-axis.",
    "My heat map should have cells that align with the corresponding year on the x-axis.",
    "My heat map should have multiple tick labels on the y-axis with the full month name.",
    "My heat map should have multiple tick labels on the x-axis with the years between 1754 and 2015.",
    "My heat map should have a legend with a corresponding id=\"legend\".",
    "My legend should contain rect elements.",
    "The rect elements in the legend should use at least 4 different fill colors.",
    "I can mouse over an area and see a tooltip with a corresponding id=\"tooltip\" which displays more information about the area.",
    "My tooltip should have a data-year property that corresponds to the data-year of the active area."
  ]
}
