{
    "name": "Random Quote Machine",
    "tagline": "A frontend project, part of Free Code Camp's curriculum",
    "for": "Practice: freeCodeCamp",
    "thumb": "/images/projects/random-quote-machine-thumb.jpg",
    "logo_inv": "/images/logos/freecodecamp-inverse.svg",
    "url": "//codepen.io/ilovepku/full/aPpadW",
    "desc": "Project summary goes here. Etiam rhoncus. Maecenas tempus, tellus eget condimentum rhoncus, sem quam semper libero, sit amet adipiscing sem neque sed ipsum. Nam quam nunc, blandit vel, luctus pulvinar, hendrerit id, lorem. Maecenas nec odio et ante tincidunt tempus. Donec vitae sapien ut libero venenatis faucibus. Nullam quis ante. Etiam sit amet orci eget eros faucibus tincidunt. Duis leo. Sed fringilla mauris sit amet nibh. Donec sodales sagittis magna. Sed consequat, leo eget bibendum sodales, augue velit cursus nunc, quis gravida magna mi a libero. Fusce vulputate eleifend sapien. Vestibulum purus quam, scelerisque ut, mollis sed, nonummy id, metus.",
    "story": ["I can see a wrapper element with a corresponding id=\"quote-box\".", "Within #quote-box, I can see an element with a corresponding id=\"text\".", "Within #quote-box, I can see an element with a corresponding id=\"author\".", "Within #quote-box, I can see a clickable element with a corresponding id=\"new-quote\".", "Within #quote-box, I can see a clickable element with a corresponding id=\"tweet-quote\".", "On first load, my quote machine displays a random quote in the element with id=\"text\".", "On first load, my quote machine displays the random quote's author in the element with id=\"author\".", "When the #new-quote button is clicked, my quote machine should fetch a new quote and display it in the #text element.", "My quote machine should fetch the new quote's author when the #new-quote button is clicked and display it in the #author element.", "I can tweet the current quote by clicking on the #tweet-quote a element. This a element should include the \"twitter.com/intent/tweet\" path in it's href attribute to tweet the current quote.", "The #quote-box wrapper element should be horizontally centered. Please run tests with browser's zoom level at 100% and page maximized."],
    "pic": "",
    "tech": ["React", "Bootstrap", "JavaScript"],
    "type": "Frontend",
    "html": "<iframe height='250' scrolling='no' title='FCC: Front End - Random Quote Machine' src='//codepen.io/ilovepku/embed/aPpadW/?height=265&theme-id=0&default-tab=result' frameborder='no' allowtransparency='true' allowfullscreen='true' style='width: 100%;'>See the Pen <a href='https://codepen.io/ilovepku/pen/aPpadW/'>FCC: Front End - Random Quote Machine</a> by Sean Lee (<a href='https://codepen.io/ilovepku'>@ilovepku</a>) on <a href='https://codepen.io'>CodePen</a>.</iframe>"
}